-- Заполнение БД my_shop демо-данными
USE my_shop;

-- Таблица users (id,phone,email,password,roll_id,status,first_name,last_name,gender,birthday_at,last_login,updated_at,created_at)
INSERT INTO `users` VALUES 
    (NULL,'79165554433','genes@example.net','f40b4fbc0c439eeed31',5,1,'Alina','Reichert',0,'2002-04-19','2021-03-08 11:34:23','2020-12-14 18:38:51','1958-11-20 17:33:46'),
    (NULL,'79164443322','genes22@example.net','f40b433c0c439eeed31',2,1,'Polina','Reichert',0,'2000-05-01','2021-03-08 11:34:23','2020-12-14 18:38:51','1958-11-20 17:33:46'),
    (NULL,'79162221100','genes77@example.net','f40b323c0c439eeed31',3,1,'Arisha','Reichert',0,'1976-05-10','2021-03-08 11:34:23','2020-12-14 18:38:51','1958-11-20 17:33:46'),   
	(NULL,'79169014411','hagenes.teagan@example.net','f4e0b4fbc0c439e26d31',3,1,'Petra','Reichert',0,'1968-04-19','2021-03-08 11:34:23','2020-12-14 18:38:51','1958-11-20 17:33:46'),
	(NULL,'79069014881','kylee15@example.org','fa2440c5c75a2778184a',3,0,'Icie','Goodwin',1,'1989-04-14','2021-02-28 06:50:30','2020-10-29 06:06:11','1958-02-25 11:17:37'),
	(NULL,'79011112233','zkris@example.com','0506e6ebf3fc91378e1b',3,0,'Sierra','Cummings',0,'1996-05-14','2021-02-26 13:35:46','2020-11-24 00:00:43','1964-12-30 02:48:55'),
	(NULL,'79035411121','jewell.muller@example.org','025812acb9176f95392d',3,1,'Howell','O\'Kon',1,'2002-08-10','2021-02-19 11:02:52','2021-02-01 02:42:22','1926-06-10 13:16:22'),
	(NULL,'79035413331','daufderhar@example.net','7aed768d4b15cd5c3d4d',3,1,'Dolores','Muller',0,'1938-01-17','2021-03-05 23:15:44','2020-06-10 12:25:29','1923-12-31 20:46:54'),
	(NULL,'79113533421','wilfrid70@example.net','557ef0efc5a60a38a691',1,0,'Genesis','Paucek',1,'1985-05-22','2021-02-20 11:58:02','2020-05-10 11:58:00','2018-01-26 11:13:19');


-- Таблица profiles
INSERT INTO `profiles` VALUES
	(NULL,3,'Nicklaus','Stark','maximillia28@example.org','79162824310','Bermuda','Rossiechester',124112,'0481 Mohr Green\nSouth Rubyefurt, ME 33778',1,'2021-03-01 02:54:54','2019-06-18 09:27:27'),
	(NULL,2,'Linnie','Wintheiser','aliyah01@example.net','79016415518','Russia','Moscow',195541,'0547 Dolly Crest\nSouth Maximilianland, WV 06714-7881',1,'2021-03-15 02:30:17','2012-10-25 10:25:11'),
	(NULL,3,'Marcia','Heaney','dixie27@example.com','79117701122','Montserrat','East Benniemouth',171816,'9268 Moen Row Apt. 247\nPort Leestad, ME 33357',1,'2021-03-12 22:14:32','2015-02-22 11:10:02'),
	(NULL,3,'Alf','Saderik','cesar41@example.net','79037581162','Bermuda','East Ernest',123451,'034 Gorczany Islands Suite 342\nDeonteland, MS 07113',0,'2021-03-10 11:13:51','2014-06-18 01:15:27'),
	(NULL,4,'Dandre','Carter','aprosacco@example.org','71115211122','Uruguay','Harveymouth',451123,'7119 Kautzer Throughway Apt. 521\nNorth Helenaview, AZ 15899-4903',1,'2021-03-06 00:01:36','2012-04-11 05:28:03'),
	(NULL,4,'Ulises','Nikolaus','thiel.melvina@example.org','79122147483','Uganda','Lenorastad',278111,'305 Carroll Rapids Suite 869\nHarleyhaven, LA 80991-1478',0,'2021-03-12 16:33:51','2015-04-29 12:00:55'),
	(NULL,5,'Kobe','Bernhard','eduardo.luettgen@example.org','79247772132','Thailand','Jailynhaven',651123,'89345 Lexie Squares\nRaefort, HI 62100-4384',1,'2021-02-28 01:32:12','2019-01-27 13:01:02'),
	(NULL,3,'Shaylee','Collins','lwindler@example.com','79150101213','Myanmar','Port Margarita',771444,'08022 Hegmann Locks\nAudrastad, VA 99543-5972',0,'2021-03-11 14:15:06','2011-09-30 19:34:22'),
	(NULL,5,'Tania','Bartoletti','ayden.dubuque@example.org','75105127712','Russia','Ianberg',501231,'058 McCullough Rue\nFraneckiside, MI 53415-5241',1,'2021-03-02 15:49:48','2017-04-26 10:22:19'),
	(NULL,6,'Willard','Walsh','lenna.purdy@example.org','72147483647','Russia','North Jaydestad',312111,'558 Eva Stream Apt. 688\nSchneiderfurt, KY 72702-1697',1,'2021-03-08 05:17:52','2011-09-26 13:31:54'),
	(NULL,1,'Esperanza','Hauck','goldner.lucio@example.org','79175414455','Russia','New Deannastad',132121,'6007 Roob Terrace\nAronfort, LA 73253-5468',1,'2021-03-01 12:51:20','2014-10-21 07:11:43'),
	(NULL,1,'Katlyn','Kulas','maxwell94@example.net','79187483647','Russia','Moscow',766171,'379 Wyman Mews\nKarachester, NV 96305',1,'2021-03-02 09:32:10','2021-01-25 13:42:21'),
	(NULL,1,'Keanu','Wehner','blanda.stefanie@example.net','79194417744','Russia','New Keelyhaven',441221,'0728 Jodie Groves Apt. 941\nRathside, MO 50055',1,'2021-03-17 15:34:41','2015-02-16 23:58:53'),
	(NULL,4,'Daisy','Huel','eliezer.hand@example.org','79991214411','Russia','Port Karentown',999112,'87454 Paucek Passage\nBotsfordburgh, CT 68288-8874',1,'2021-02-27 11:54:41','2015-07-20 16:26:56'),
	(NULL,4,'Myrtice','Johnston','dbeatty@example.net','79168494512','Russia','Runtehaven',551312,'9074 Zula Mountains\nLethaview, SD 12272-7857',1,'2021-03-12 06:07:58','2013-04-07 23:08:01'),
	(NULL,5,'Ivan','Ivanov','ivan@mail.ru','79161012229','Russia','Moscow',129515,'Argunovskay str. 10k1',1,'2021-03-02 15:49:48','2017-04-26 10:22:19'),
	(NULL,3,'Zahar','Ivanov','zaharivanov@mail.ru','79141012229','Russia','Moscow',129515,'Argunovskay str. 9k1',1,'2021-03-02 15:49:48','2017-04-26 10:22:19');


-- Таблица roll
INSERT INTO `roll` VALUES 
	(NULL,'Администратор', 1, '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Менеджер', 0, '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Покупатель', 1, '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Незарегистрированный пользователь', 1, '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Маркетолог', 1, '2021-03-12 04:39:01','2021-03-12 04:39:01');


-- Таблица product_category
INSERT INTO `product_category` VALUES 
	(NULL,1,1,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,2,1,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,3,1,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,4,5,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,5,5,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,6,5,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,7,5,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,8,5,'2021-03-12 04:39:01','2021-03-12 04:39:01');


-- Таблица categories
INSERT INTO `categories` VALUES 
	(NULL,'Юбки','Юбка – оружие современной женщины','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Шорты','Шорты – оригинальные варианты одежды, которые не выходят из обихода вот уже несколько десятилетий.','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Рубашки','Женские рубашки являются неотъемлемой частью гардероба женщин любых возрастов. ','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Брюки','Женские брюки могут использоваться в любое время года. ','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Футболки','Футболки являются базовым элементом женского гардероба, они могут составить основу практически любого повседневного образа.','2021-03-12 04:39:01','2021-03-12 04:39:01');


-- Таблица stock
INSERT INTO `stock` VALUES 
	(NULL,1,0,10,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,2,0,0,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,3,2,6,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,4,0,2,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,5,0,3,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,6,1,4,'2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,7,0,200,'2021-03-12 04:39:01','2021-03-12 04:39:01');
	

-- Таблица reviews (id, user_id, product_id, rating, description, status, updated_at, created_at)
INSERT INTO `reviews` VALUES
	(NULL,3,1,5,'Идеально для делового стиля',0,'2006-04-09 00:41:54','2020-09-19 20:28:55'),
	(NULL,1,1,5,'Понравился цвет, материал добротный',1,'2020-10-29 06:06:11','1958-02-25 11:17:37'),
	(NULL,4,2,4,'Ужасные швы, маломерка!',1,'2020-11-24 00:00:43','1964-12-30 02:48:55'),
	(NULL,2,4,4,'Все понравилось',0,'2021-02-01 02:42:22','1926-06-10 13:16:22'),
	(NULL,5,5,5,'Вернула обратно, ужасное качество',1,'2020-06-10 12:25:29','1923-12-31 20:46:54'),
	(NULL,1,1,5,'Давно искала и нашла, полюбила с первого взгляда',1,'2020-05-10 11:58:00','2018-01-26 11:13:19'),
	(NULL,6,1,5,'Идеально для делового стиля',0,'2006-04-09 00:41:54','2020-09-19 20:28:55'),
	(NULL,7,1,5,'Понравился цвет, материал добротный',1,'2020-10-29 06:06:11','1958-02-25 11:17:37'),
	(NULL,5,2,4,'Ужасные швы, маломерка!',1,'2020-11-24 00:00:43','1964-12-30 02:48:55'),
	(NULL,4,4,4,'Все понравилось',0,'2021-02-01 02:42:22','1926-06-10 13:16:22'),
	(NULL,3,5,5,'Вернула обратно, ужасное качество',1,'2020-06-10 12:25:29','1923-12-31 20:46:54'),
	(NULL,2,5,5,'Вернула обратно, ужасное качество',1,'2020-06-10 12:25:29','1923-12-31 20:46:54'),
	(NULL,1,5,5,'Вернула обратно, ужасное качество',1,'2020-06-10 12:25:29','1923-12-31 20:46:54'),	
	(NULL,3,1,5,'Давно искала и нашла, полюбила с первого взгляда',1,'2020-05-10 11:58:00','2018-01-26 11:13:19');


-- Таблица products
INSERT INTO `products` VALUES 
	(NULL,'Юбка JS Collections','5862366','1','1','2','Строгая юбка черного цвета на лето','Сезон: лето. Состав: 97% полиэстер, 3% спандекс.','1','3480','2021-03-12 04:39:01','2021-03-12 04:39:01'),	
	(NULL,'Юбка JS Collections','5862365','2','1','2','Строгая юбка черного цвета на лето','Сезон: лето. Состав: 97% полиэстер, 3% спандекс.','2','3480','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Юбка JS Collections','5862364','4','1','2','Строгая юбка черного цвета на лето','Сезон: лето. Состав: 97% полиэстер, 3% спандекс.','3','3480','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Футболка PAUL&SHARK','47651-15','2','3','1','Белая классическая футболка из натурального хлопка','Футболка от бренда PAUL&SHARK. Модель полуприлегающего кроя, белого цвета. Круглый ворот под горло, короткий рукав, акула желтого цвета на груди, фирменный значок на левом рукаве.','4','12100','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Футболка PAUL&SHARK','47652-15','3','3','1','Белая классическая футболка из натурального хлопка','Футболка от бренда PAUL&SHARK. Модель полуприлегающего кроя, белого цвета. Круглый ворот под горло, короткий рукав, акула желтого цвета на груди, фирменный значок на левом рукаве.','5','12100','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Футболка PAUL&SHARK','47653-15','1','3','1','Белая классическая футболка из натурального хлопка','Футболка от бренда PAUL&SHARK. Модель полуприлегающего кроя, белого цвета. Круглый ворот под горло, короткий рукав, акула желтого цвета на груди, фирменный значок на левом рукаве.','6','12100','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Футболка PAUL&SHARK','47650-15','4','3','1','Белая классическая футболка из натурального хлопка','Футболка от бренда PAUL&SHARK. Модель полуприлегающего кроя, белого цвета. Круглый ворот под горло, короткий рукав, акула желтого цвета на груди, фирменный значок на левом рукаве.','7','12100','2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'Шорты PAUL&SHARK','47333-15','1','3','1','Белые короткие шорты идеальны для прогулки','Шорты от бренда PAUL&SHARK. Модель полуприлегающего кроя, белого цвета. ','8','4500','2021-03-12 04:39:01','2021-03-12 04:39:01');


-- Таблица size
INSERT INTO `size` VALUES 
	(NULL,'36', '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'L', '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'42', '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'XL', '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'XXL', '2021-03-12 04:39:01','2021-03-12 04:39:01');


-- Таблица color
INSERT INTO `color` VALUES 
	(NULL,'серый', '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'белый', '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'синий', '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'черный', '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'красный', '2021-03-12 04:39:01','2021-03-12 04:39:01'),
	(NULL,'голубой', '2021-03-12 04:39:01','2021-03-12 04:39:01');


-- Таблица brands
INSERT INTO `brands` VALUES 
	(NULL,'JS Collections','Россия','Молодой, но уже популярный бренд родом из России','logo_js_collection.jpg','2021-02-28 19:12:15','2021-03-03 12:20:40'),
	(NULL,'PAUL&SHARK','США','Знаминитый бренд родом из США имеет большое кол-во поклонников по всему мирк','logo_paul_shark.jpg','2021-03-04 12:22:41','2021-02-27 08:38:18'),
	(NULL,'D&W','Италия','Европейский бренд любим за классический стиль','logo_d_w.jpg','2021-03-02 13:04:08','2021-03-13 06:23:51'),
	(NULL,'Black style','Канада','Молодежная одежда радующая цветом и качеством','logo_black_style.jpg','2021-03-06 20:56:03','2021-03-16 09:13:32');


-- Таблица media
INSERT INTO `media` VALUES
	(NULL,'tempora.jpg','5421','Repellendus eaque quo porro officiis accusantium magni rerum.','2021-03-06 21:53:41','2021-02-28 21:42:00'),
	(NULL,'tem.jpg','6047','Dolorum quasi laborum iure numquam.','2021-02-23 17:26:29','2020-04-28 15:26:51'),
	(NULL,'sunt.jpg','4735','Odio fugiat itaque doloribus ut.','2021-03-17 22:27:28','2020-04-22 21:19:16'),
	(NULL,'vitae.jpg','8492','Magnam est tempore dolore magnam.','2021-03-11 07:12:08','2020-06-19 22:34:48'),
	(NULL,'asperiores.jpg','8156','Sapiente id in quasi sint dolore recusandae.','2021-02-24 00:36:09','2021-01-10 07:23:00'),
	(NULL,'odio.jpg','9633','Quas id aut mollitia aut vitae ut.','2021-03-14 04:51:37','2021-01-14 07:33:36'),
	(NULL,'occaecati.jpg','1212','Enim quis possimus natus et blanditiis animi.','2021-03-04 12:11:16','2021-03-13 05:54:34'),
	(NULL,'in.jpg','6637','Modi excepturi fuga facilis enim omnis sunt est.','2021-03-15 09:07:59','2020-12-18 07:04:22'),
	(NULL,'recusandae.jpg','93284','Eius ab voluptas necessitatibus suscipit velit quo commodi.','2021-03-04 16:31:13','2020-07-29 05:02:26'),
	(NULL,'nulla.jpg','43434','Et minima ab quidem dicta voluptatem repellat illo.','2021-03-11 10:28:24','2020-12-01 17:17:29');


-- Таблица orders (id, user_id, profile_id, order_status_id, note, updated_at, created_at)
INSERT INTO `orders` VALUES 
	(NULL,9,1,1,'Доставить до 19:00','2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,2,2,2,'Незвонить','2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,9,7,3,'Как можно быстрей','2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,8,3,4,'Только в выходные','2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,4,8,5,'Незвонить','2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,1,6,1,'Перезвоните мне быстрей!','2021-03-18 11:11:39','2021-03-18 11:11:39');

SELECT 

-- Таблица order_status
INSERT INTO `order_status` VALUES 
	(NULL,'Создан','2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,'Подтвержден','2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,'Собран','2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,'Отправлен','2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,'Выполнен','2021-03-18 11:11:39','2021-03-18 11:11:39');


-- Таблица basket (id, user_id, profile_id, order_status_id, note, updated_at, created_at)
INSERT INTO `basket` VALUES 
	(NULL,1,1,3,1,12411,'2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,2,2,2,1,3599,'2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,1,4,4,2,4551,'2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,3,3,2,1,977,'2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,4,4,1,1,977,'2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,1,6,5,1,221,'2021-03-18 11:11:39','2021-03-18 11:11:39');


-- Таблица discounts
INSERT INTO `discounts` VALUES 
	(NULL,1,0.2,'2021-03-18 11:11:39','2021-03-19 11:11:39','2021-03-11 10:28:24','2020-12-01 17:17:29'),
	(NULL,1,0.50,'2021-04-18 11:11:39','2021-04-18 11:11:39','2021-03-11 10:28:24','2020-12-01 17:17:29'),
	(NULL,3,0.11,'2021-03-18 11:11:39','2021-03-25 11:11:39','2021-03-11 10:28:24','2020-12-01 17:17:29'),
	(NULL,4,0.04,'2021-03-18 11:11:39','2021-03-20 11:11:39','2021-03-11 10:28:24','2020-12-01 17:17:29'),
	(NULL,5,0.75,'2021-04-02 11:11:39','2021-04-10 11:11:39','2021-03-11 10:28:24','2020-12-01 17:17:29');


-- Таблица pay_systems
INSERT INTO `pay_systems` VALUES 
	(NULL, 'Банковской картой онлайн', 1, '2021-03-18 11:00:08', '2021-03-18 11:00:08'),
	(NULL, 'Банковски переводом', 1, '2021-03-18 11:00:08', '2021-03-18 11:00:08'),
	(NULL, 'При получении', 0, '2021-03-18 11:00:08', '2021-03-18 11:00:08');


-- Таблица transactions
INSERT INTO `transactions` VALUES 
	(NULL,9,1,1,12411,'successful',1,1,'2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,2,2,2,3599,'successful',1,1,'2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,1,6,1,4511,'successful',1,1,'2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,8,3,1,977,'successful',1,1,'2021-03-18 11:11:39','2021-03-18 11:11:39'),
	(NULL,8,4,2,977,'successful',1,0,'2021-03-18 11:11:39','2021-03-18 11:11:39');	